from enum import Enum


class Answers(Enum):
    HELP = "У разі необхідності термінової консультації звертайтесь за телефонами:\n0660501737 (Стадніченко Надія Василівна)\n0939894698 (Кузьмін Костянтин Сергійович)"
    NO_ATTACHMENTS = "Ви повинні додати відео файл(и) з підписом(виконавець, автор, назва твору)."
    NO_CAPTION = "Кожен відофайл повинен бути підписаний: Прізвище, ім'я, по батькові"
    START = "01.07.22 та 11.07.22 - Відбудуться констультації на платформі Zoom(id: 3822859953; password: 601746)\n\nДля складання іспиту \"Творчий конкурс\" вам потрібно надіслати запис виконання:\n4.07 - Літературних творів(уривок з прози, вірш, байка, монолог)\n7.07 - Вокальних творів\n12.07 - Хореографічних композицій\n14.07 - Етюдів\nЗгідно з програмою творчого конкурсу\n\n18.07 - Мотиваційний лист"
    SUBMITTED = "Дякуємо, ми отримали Ваші файл(и)."
    NO_INTEREST = "Ви повинні додати відео файл(и) з підписом(виконавець, автор, назва твору)."
