import os
from dotenv import load_dotenv
from enum import Enum

load_dotenv()


class Answers(Enum):
    APPLY = f"<a href='{os.getenv('APPLICATION_LINK')}'>Подати заявку</a>"
    HELP = "У разі необхідності термінової консультації звертайтесь за телефонами:\n" + \
           "<code>0660501737</code> (<b>Стадніченко Надія Василівна</b>)\n" + \
           "<code>0939894698</code> (<b>Кузьмін Костянтин Сергійович</b>)"
    LETTER_INSTRUCTIONS = "Надішліть боту текстовий файл із мотиваційним листом. Будь ласка, назвіть файл у форматі: " + \
                          "<b>Прізвище, ім'я, по батькові – Мотиваційний лист</b>.\n\n" + \
                          "Формати, які ми підтримуємо: " + \
                          "<code>pdf</code>, <code>txt</code>, <code>doc</code>, <code>docm</code>, <code>docx</code>, " + \
                          "<code>dot</code>, <code>dotm</code>, <code>dotx</code>, <code>odt</code>, <code>rtf</code>"
    LETTER_SUBMITTED = "Дякуємо, ми отримали Ваш мотиваційний лист!"
    NO_ATTACHMENTS = "Ви повинні додати <b>відео файл(и)</b> з підписом(<b>виконавець</b>, <b>автор</b>, <b>назва твору</b>)."
    NO_CAPTION = "Кожен відофайл повинен бути підписаний: <b>Прізвище</b>, <b>ім'я</b>, <b>по батькові</b>"
    START = "<b>01.07.22</b> та <b>11.07.22</b> - Відбудуться <b>констультації на платформі " + \
            "Zoom</b>(id: <code>3822859953</code>; password: <code>601746</code>)\n\n" + \
            "Для складання іспиту \"Творчий конкурс\" вам потрібно надіслати запис виконання:\n" + \
            "<b>4.07</b> - <b>Літературних творів</b>(уривок з прози, вірш, байка, монолог)\n" + \
            "<b>7.07</b> - <b>Вокальних творів</b>\n" + \
            "<b>12.07</b> - <b>Хореографічних композицій</b>\n" + \
            "<b>14.07</b> - <b>Етюдів\nЗгідно з програмою творчого конкурсу</b>\n\n" + \
            "<b>18.07</b> - <b>Мотиваційний лист</b>"
    SUBMITTED = "Дякуємо, ми отримали Ваші файл(и)."
    NO_INTEREST = "Ви повинні додати <b>відео файл(и)</b> з підписом(<b>виконавець</b>, <b>автор</b>, <b>назва твору</b>)."
    WRONG_MIME_TYPE = "<b>Неправильний формат файлу!</b>\nМи підтримуємо такі формати: " + \
                      "<code>pdf</code>, <code>txt</code>, <code>doc</code>, <code>docm</code>, <code>docx</code>, " + \
                      "<code>dot</code>, <code>dotm</code>, <code>dotx</code>, <code>odt</code>, <code>rtf</code>"
